backend/app/controllers/events_controller.rb

  def index
    render json: { allEvent: Event.where(user_id: params[:user_id]) }
---
SELECT `events`.* FROM `events` WHERE `events`.`user_id` IS NULL LIMIT 1