backend/app/controllers/events_controller.rb

INSERT INTO `events` (`user_id`, `date`, `title`, `body`, `name`, `created_at`, `updated_at`) VALUES (4, '2023-04-02', 'event2', 'body2', 'matsuda', '2023-04-26 07:34:11.720459', '2023-04-26 07:34:11.720459')
---
  def create
    event = Event.new(params.permit(:body, :date, :name, :title, :user_id))
    if event.save

SELECT `events`.* FROM `events` WHERE `events`.`id` = 9 LIMIT 1
DELETE FROM `events` WHERE `events`.`id` = 9
---
  def destroy
    event = Event.find_by(id: params[:id])
    if event.destroy

SELECT `follows`.* FROM `follows` WHERE `follows`.`follow_id` = 0 AND `follows`.`isApprove` = 'false'
SELECT `follows`.* FROM `follows` WHERE `follows`.`users_id` = 0 AND `follows`.`isApprove` = 'true'
INSERT INTO `follows` (`users_id`, `follow_id`, `isApprove`, `created_at`, `updated_at`) VALUES (4, 6, 'false', '2023-04-28 14:28:50.265376', '2023-04-28 14:28:50.265376')
SELECT `events`.* FROM `events` WHERE `events`.`user_id` = 0
SELECT `events`.* FROM `events` WHERE `events`.`user_id` IN (6, 4)
---
  def index
    followers = Follow.where(follow_id: params[:user_id], isApprove: "false")
    visible_follows = Follow.where(users_id: params[:user_id], isApprove: "true")
    followers_info = []
    visible_follows_id = []
    for data in followers do
      followers_info << data[:users_id]
    end
    for data in visible_follows do
      visible_follows_id << data[:follow_id]
    end
    if visible_follows.length == 0
      render json: { allEvent: Event.where(user_id: params[:user_id]), followers: followers, followers_info: User.where(id: followers_info) }
    else
      render json: { allEvent: Event.where(user_id: params[:user_id]), visible_follows_event: Event.where(user_id: visible_follows_id) , followers: followers, followers_info: User.where(id: followers_info) }

SELECT `users`.* FROM `users` WHERE `users`.`name` = 'matsuda2' AND `users`.`email` = 'test12@mail.com' LIMIT 1
INSERT INTO `follows` (`users_id`, `follow_id`, `isApprove`, `created_at`, `updated_at`) VALUES (7, 6, 'false', '2023-04-29 12:05:10.563973', '2023-04-29 12:05:10.563973')
---
  def createFollow
    follow_user = User.find_by(name: params[:follow_name], email: params[:follow_mail])
    data = {"users_id"=>params[:user_id], "follow_id"=>follow_user[:id], "isApprove"=>"false"}
    follow = Follow.new(data)
    if follow.save!

SELECT `follows`.* FROM `follows` WHERE `follows`.`users_id` = 7 AND `follows`.`follow_id` = 6 LIMIT 1
UPDATE `follows` SET `follows`.`isApprove` = 'true', `follows`.`updated_at` = '2023-04-29 12:05:31.479361' WHERE `follows`.`id` = 2
---
  def updateFollow
    follow = Follow.find_by(users_id: params[:follower_id], follow_id: params[:user_id])
    if params[:is_approve] == 'true'
      follow.update(isApprove: 'true')